<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of curl, compiles it and creates a pkg installer.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.pkg.curl</string>
	<key>Input</key>
	<dict>
		<key>INSTALL_PATH</key>
		<string>/usr/local</string>
		<key>INSTALL_PATH_OWNER</key>
		<string>root</string>
		<key>INSTALL_PATH_GROUP</key>
		<string>wheel</string>
		<key>PACKAGE_ID</key>
		<string>se.haxx.curl.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.curl</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
				<key>archive_format</key>
				<string>tar_gzip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CurlCompiler</string>
			<key>Arguments</key>
			<dict>
				<key>curl_source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%</string>
				<key>curl_install_path</key>
				<string>%INSTALL_PATH%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
			<key>Arguments</key>
			<dict>
				<key>template_path</key>
				<string>PackageInfoTemplate</string>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>force_pkg_build</key>
				<true />
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>%PACKAGE_ID%</string>
					<key>resources</key>
					<string>Resources</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>%INSTALL_PATH%</string>
							<key>user</key>
							<string>%INSTALL_PATH_OWNER%</string>
							<key>group</key>
							<string>%INSTALL_PATH_GROUP%</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
