<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest curl source.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.curl</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>curl</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://curl.haxx.se/latest.cgi?curl=tar.gz</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;http://curl\.haxx\.se/download/curl-(?P&lt;version&gt;[0-9\.]+)\.tar.gz)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
